# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Dec 19 14:28:48 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design Calculator

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.05 [get_ports {Result[15]}]
set_load -pin_load 0.05 [get_ports {Result[14]}]
set_load -pin_load 0.05 [get_ports {Result[13]}]
set_load -pin_load 0.05 [get_ports {Result[12]}]
set_load -pin_load 0.05 [get_ports {Result[11]}]
set_load -pin_load 0.05 [get_ports {Result[10]}]
set_load -pin_load 0.05 [get_ports {Result[9]}]
set_load -pin_load 0.05 [get_ports {Result[8]}]
set_load -pin_load 0.05 [get_ports {Result[7]}]
set_load -pin_load 0.05 [get_ports {Result[6]}]
set_load -pin_load 0.05 [get_ports {Result[5]}]
set_load -pin_load 0.05 [get_ports {Result[4]}]
set_load -pin_load 0.05 [get_ports {Result[3]}]
set_load -pin_load 0.05 [get_ports {Result[2]}]
set_load -pin_load 0.05 [get_ports {Result[1]}]
set_load -pin_load 0.05 [get_ports {Result[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Operation[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Operation[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {Result[0]}]
set_input_transition 0.12 [get_ports rst]
set_input_transition 0.12 [get_ports {A[7]}]
set_input_transition 0.12 [get_ports {A[6]}]
set_input_transition 0.12 [get_ports {A[5]}]
set_input_transition 0.12 [get_ports {A[4]}]
set_input_transition 0.12 [get_ports {A[3]}]
set_input_transition 0.12 [get_ports {A[2]}]
set_input_transition 0.12 [get_ports {A[1]}]
set_input_transition 0.12 [get_ports {A[0]}]
set_input_transition 0.12 [get_ports {B[7]}]
set_input_transition 0.12 [get_ports {B[6]}]
set_input_transition 0.12 [get_ports {B[5]}]
set_input_transition 0.12 [get_ports {B[4]}]
set_input_transition 0.12 [get_ports {B[3]}]
set_input_transition 0.12 [get_ports {B[2]}]
set_input_transition 0.12 [get_ports {B[1]}]
set_input_transition 0.12 [get_ports {B[0]}]
set_input_transition 0.12 [get_ports {Operation[1]}]
set_input_transition 0.12 [get_ports {Operation[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.05 [get_ports clk]
set_clock_uncertainty -hold 0.05 [get_ports clk]
